Revit 2024 API
AdvancedWood.WoodFiberCosineProf Property
 The property labeled "Profile for fiber cosine function" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WoodFiberCosineProf { get; }
Visual Basic
Public Shared ReadOnly Property WoodFiberCosineProf As String
	Get
Visual C++
public:
static property String^ WoodFiberCosineProf {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace